Repository: miurahr/translate-oss-legal
Catalog: omegat/project_save.tmx
Source language: ja
Languages: en

source: 2011年3月
en: 2011 March

source: Apacheなど、重要なソフトウェアがBSDライセンスにて提供されていることに触れる。
en: There are many BSD licensed important software such as Apache http server.

source: BSDライセンスは、再頒布の条件として著作権表示、ライセンス条文、ソフトウェアについて保証が無いという「免責条項」をドキュメントに記載すればよく、オリジナルに追加したコードを公開する義務が無いため、GPLに比べて商用に利用しやすいということ。
en: In BSD license, a condition for redistribution is very simple that is just to include copyright holder, license codes, and no guarantee of software - "disclaimer" in document, and no obligation to publish its source code. It is easier to use commercial software than GPL.

source: Developer’s Certificate of Originによりコードの正当性を維持担保できるということ
en: Validity of source code is protected by Developer's Certificate of Origin.

source: GPLのソフトウェアはOSSのライセンスとして多数使われているので、全く使わないということは難しい場合もあるということ
en: There are so many GPL-ed software which is vital for everyday life, it is quite difficult not to use any GPL-ed software ever.

source: GPLの二つの特徴である、Copyleftと派生物の範囲について
en: Two big characters of GPL; Copyleft and deliverable

source: GPLの伝搬性について、簡単に復習をした後で、GPLの伝搬性とリスクについて説明する。
en: After review of propagation of GPL, explain risks from GPL propagation.

source: Linuxを扱うベンダーが訴えられる事例を経て、OSS関連団体が結束してOSSへの提訴事例へ対応する体制が整備されているという動向を把握する。
en: OSS related associations make a unite effort to build system treating cases of OSS legal challenges after suing case toward Linux vendors.

source: MPLから派生したライセンスや、MPLや派生ライセンスを利用したソフトウェアの質と量について強調して伝えることで、商用向きであることを実感させる。
en: Emphasize commercial software business on MPL and MPL derivative licenses, through MPL-ed OSS quantity and quality.

source: MPLの歴史背景とともに、MPLは企業がソフトウェアでのビジネスを展開することにうまく使えるような条件を付加してあるという点を強調する。
en: Emphasize both history and its background of MPL, and conditions for company that can use for software business.

source: MPLはオープンソースの特徴である Copyleft を取り込みながらも、実際に企業がソフトウェアでのビジネスを展開することにうまく使えるような条件を付加してあること
en: MPL has a feature of Copyleft but it also has conditions that is good for software business with published company.

source: MPLは企業がオープンソース・ライセンスで新たにソフトウェアを公開する際に参照されることが多く、すでに類似のライセンスが多数存在すること
en: There are many similar licenses with MPL, that is refered as good example of business OSS license from companies which is interested in publish their software as OSS.

source: OSI(Open Source Initiative) が定めた10項目に適合したライセンスで配布されるソフトウェアをオープンソース・ソフトウェア(OSS)と呼ぶこと
en: We can call software as OSS that is distributed under licenses that is suited with10 terms of OSS definition by OSI(Open Source Initiative).

source: OSSが特許を侵害する経緯
en: How OSS infringed with patent

source: OSSであっても商標に関しては他のソフトウェアと同じ法の下で扱われており、商標が必要な場合には早期に確保しておく必要があるということ
en: Even in OSS, we need to be compliance with trademarks. Because trademark is common with OSS and other software, and if the project use some trademark, the project should ensure the right to use.

source: OSSと商用ライセンスの目的、料金、関係者における違いについて
en: Difference in purpose, fee and stakeholder among OSS and business licenses.

source: OSSと知的財産権は今後のビジネスシーンでも重要なポイントになること
en: OSS and IP is an important point in business.

source: OSSと著作権、特許権、商標権の関係についての整理
en: relationship among OSS, copyright, patent, and trademark

source: OSSのコミュニティによる開発スタイル
en: Development style in OSS communities

source: OSSのコンサルテーションや保険サービスについて
en: Consultation services and insurance services for OSS utilization.

source: OSSのソースコードが商用ソフトウェアへ混入するリスク対策としてのソリューションについて
en: Solutions example for risk management protecting against OSS source code merger into business software.

source: OSSのビジネスの事例を説明する際に、受講者の前提知識によっては、各企業の社会における位置づけ、会社規模などの説明も追加する。
en: When explain OSS business case study, lecturer can add an explanations of a scale and position of several major OSS companies according with students knowledge level.

source: OSSのライセンス条件はキーとなる存在であること
en: OSS License condition is a key component.

source: OSSの各パッチにはそれぞれ作成者に著作権があるので、このパッチをソースコードに適用すれば、適用した部分のソースコードはパッチ作者の著作物となるということ
en: When some patch applied to source code, the source code is a work of joint authors, because each patch is copyrighted by a patch creator.

source: OSSの開発や利用の際にOSSライセンスとどのように付き合うべきか
en: How we should treat OSS licenses when developing or using OSS.

source: OSSは今後のイノベーションの源泉であること
en: OSS is a fuel of Innovation.

source: OSSは特許のモデルと合致しにくい面が多いこと
en: There are some collision between OSS and patent.

source: OSSライセンスと著作権の関係
en: Relationship between OSS license and copyright

source: OSSライセンスに関するリスク
en: Risk on OSS license

source: OSS利用に関するリスク
en: Risks of OSS utilization

source: SCO訴訟、GPL違反訴訟の事例を通じた、GPL侵害のリスクへの対応について
en: Understanding risks of GPL infringement through SCO case, and court challenge against GPL infringement.

source: SCO訴訟の結果、エンドユーザにまでライセンス料を取ろうとしたなどのリスクが増加したため、訴訟ファンドや保険が誕生するなど、社会的な問題として受け止められていたことを認識させる。
en: Understand that OSS legal case was accepted as a social issue. Some company and non-profit entities have started law suit fund and insurance against OSS legal risks, because the risk has been actualized and raised such as law suit challenge against end users of OSS in the SCO legal case..

source: 「ソフトウェアと法務」
en: Software and Legal

source: あるOSSと一体化したソフトウェア全体に対して、ソースコードの公開等、OSSライセンスの許諾条件の影響がおよぶことを伝搬性の仕組み
en: Propagation mechanism of OSS license between original software to merged software codes, when aquiring OSS code into another code. As a result, you may be forced to make your code public.

source: この回で習得すべき点を以下に示す。
en: Points for this class

source: さらにその背景にある法務知識としての知的財産権について解説し、OSSに関し現在、社会で問題になっている事例について解説する。
en: And explain Intellectual property that is background for license. Also explains cases which is issues in society around OSS now.

source: その上で、OSSライセンスと、商用ライセンスについて、対比で違いを把握させる。
en: Grab a contrast between OSS licenses and business licenses.

source: その他のリスク
en: Other risks

source: その他の知財権とOSS
en: OSS and another intellectual properties

source: まず、オープンソース・ソフトウェアの定義を明確にする。
en: First, clarify an understandings of definition of OSS.

source: また、GPL、MPL、BSD型の各種ライセンスの比較を通して、第3回～第5回の復習をする。
en: Also review 3rd - 4th class by comparison among GPL, MPL and BSD style licenses.

source: また、『OSSでの知的財産権以外のリスク項目』については、企業では頻繁に利用される用語であることを伝える。
en: Making stress on "Risks other than Intellectual properties in OSS" is common word for corporation.

source: また、オープンソース・ソフトウェアと著作権の関係について、違反によるペナルティーなどの観点から、看過できない問題であると認識させる。
en: Copyright and OSS has a deep relationship , and there becomes penalty when infringement of copyright.

source: また、オープンソース・ソフトウェアのライセンスの種類が多種存在する事実と背景を説明する。
en: Understand the fact that there are so many OSS licenses and its background.

source: また、クローズとでプロプライエタリなソフトウェアとオープンソース・ソフトウェアという対比を示すとともに、対比の構図ができあがった過程を把握させる。
en: Show comparison among Closed and proprietary software and Open Source Software, and illustrate process of completeness.

source: また、可能な範囲で、最新の訴訟事例を追加していくことで、学生の興味を高めさせる。
en: Lecturer is requested here to take recent law suit case in the class in order to raise students interest.

source: また、大手企業がGPL違反で訴訟問題に巻き込まれている現状と、それを受けて、企業の中でのGPL順守への意識の高まりがあるという動向を把握させる。
en: There are several cases that some well-established companies were challenged in court against GPL infringement. That is why major companies now aware with GPL observance as a trend.

source: また、特許権については、海外との関係も無視できないため、その点について海外の事例を踏まえて説明する。
en: Also patent is an issue in global and explains international legal case of patent.

source: また、知的財産権とOSSに関する事項の習得を目指す。
en: Learn about intellectual property and OSS

source: オープンソースの開発スタイルについては、パッチ単位で修正を繰り返すＯＳＳの開発スタイルでは、いつ、誰が修正したのか、その権利はどうなのかを後にトレースする仕組みが弱かったという状況を受講生が想像できるように、受講者の背景知識によっては用語の説明を丁寧にする。
en: Detailed explanation of glossary is required in this class. Because student sometimes does not know a OSS development style, which continuously change source code by patch makes difficult to track the part of source code history, authors, and copyright.

source: オープンソフトウェア利用促進事業
en: Open Software Utilize Promotion Program

source: オープンソース・ソフトウェアのリスクと関係するステークホルダーについて説明する際には、多くの受講者が含まれるであろう利用者、エンドユーザも含まれることを強調する。
en: When explaining stakeholders related to risks of Open Source Software, there also includes end users, some of who is students.

source: オープンソース・ライセンスの概要
en: Abstract of Open Source License

source: クラウドやスマートフォンと言った、最近注目のプラットフォームでもOSSのライセンスを無視してビジネスをすることが難しくなっていることを認識させる。
en: Open student eyes for difficult things without OSS license on recent growing platform such as cloud or smart phone.

source: コミュニティの開発スタイル、コミュニティのリスク対策、および企業のリスク対策に関する事項の習得を目指す。
en: Learning development style in OSS community, and risk management in community and company.

source: ソフトウェアの利用機会やソフトウェアの販売事例などから、ソフトウェアの社会における重要性と市場の規模感を実感させる。
en: make understand importance in society and market size of software from use case of software and growth of software business

source: ソフトウェアの知財を巡り、訴訟合戦に至ることを認識させる。
en: There are many chances to challenge in court against software intellectual property.

source: ソフトウェアは家や自動車とは異なる存在、音楽や著作物のようなものと似ているということ
en: Software is different with house and car, is rather similar to music and literary work.

source: ソフトウェアは現代社会の中でなくてはならないものになってきていること
en: Software becomes vital in modern society.

source: ソフトウェア特許とOSSの問題は今後の整理が必要であること
en: Legal entities such as law maker and law suit have pending issues to resolve conflict between OSS and software patent.

source: ソフトウェア特許をめぐる動向
en: Trend on software patent

source: ブラウザの歴史とも関連しているため、受講生の年代や、ブラウザの利用履歴などにも可能な範囲で留意して進める。
en: That is depend on history of web browser, lecturer should take care of student age and experience which web browser they used.

source: リスク軽減策の活動事例
en: Initiatives to reduce OSS risks

source: 一般にソフトウェアは「使用許諾契約書」といった契約書によって権利を許諾され、その代金を支払うという形で契約することになっていること
en: In general, users use software by getting usable permissions with "license agreement" contract document, that defined its fee.

source: 上記の潜在リスクについて、GPLだけでなく、OSSライセンスの意味を正しく理解し、条件を遵守することがリスク低減につながることを認識させる。
en: Understand that keeping condition and understand a meaning of OSS license not only GPL also other licenses is a best way for managing and reducing these risks.

source: 世界のOSSライセンスの割合について
en: Proportion of OSS licenses in the world

source: 代表的なOSSライセンス（BSD型）
en: Typical OSS license (BSD)

source: 代表的なOSSライセンス（GPL型）
en: Typical OSS license (GPL)

source: 代表的なOSSライセンス（MPL型）
en: Typical OSS license (MPL)

source: 企業が自社で商用ソフトウェアを開発しており、同時にOSSも活用している場合で、商用ソフトウェアへのOSSソースコードの混入リスクがあることと、それを検証・保証するサービスも存在するという市場が存在することを意識させる。
en: There is a risk to mix in OSS into closed software when company develop production software to sell others and also utilize OSS. There are services and products to validate source code not to mix in OSS.

source: 企業と知的財産管理ビジネス
en: Company and IP business

source: 企業活動でもコミュニティへの貢献に関する方針、コミュニティに関わる従業員への支援方針、ＯＳＳに関わる留意点と対策に関する方針、自社開発ソフトウェアをＯＳＳとして公開する際の方針などの検討がなされることを認識させる。
en: Companies also make discussion and defining guidelines for contribution policy, support program of employers, rules to use OSS, policy to publish in-house software as OSS.

source: 伝搬性の意味や使い方を正しく認識した上で管理しながら利用すればリスクを事前に回避することが可能であるということ
en: It is possible to avoid risk when using GPL-ed software with correct management, and correct understanding of a meaning of propagation and usage.

source: 具体的な訴訟事例に関する事項の習得を目指す。
en: Students will learn through items related to actual litigation case.

source: 内容としては、今後の社会で不可欠な存在になると予想されるOSSについて、OSSの基礎になっている 「ライセンス」 に関する基本を解説している。
en: There is a content includes basics of OSS license, because OSS will be more important than before, and vital part in future society.

source: 各回の詳細
en: Descriptions

source: 各国の「ソフトウェア特許要件(patentability)」の考え方の共通点
en: Common part of "software patent-ability" in each country

source: 商標権、ブランドといった受講者にとって比較的身近な権利もオープンソース・ソフトウェアでは関係があり、特にビジネスを考えた際には早期から対応が必要となることを認識させる。
en: Rights which are familiar for ordinary users such as trademark and brand, are also related to OpenSource Software and it is important to deal with it in early stage for business

source: 商標権に関するリスク
en: Risk on Trademark

source: 商用ソフトウェアにおける特許権とOSSにおける特許権の違い
en: Difference of nature between patent on commercial software and one on OSS

source: 商用ソフトウェアの利用許諾契約書とOSSライセンスの違い
en: Difference between "license agreement" in commercial software and OSS licenses.

source: 多くの企業がOSSをビジネスに活用することをすでに実施しており、ビジネスとして市場もできていること
en: There are many enterprise utilizing OSS in their business. There also exist OSS business market.

source: 実際にライセンスを選択する際の注意点について説明する際には、受講生にも関係するようなツールを題材に伝えるなど、当事者意識を持たせる。
en: When explaining caution of choice of license in actual scene, accent on sense of ownership, by use case study that is familiar for student.

source: 最後に、第3回～第5回で扱ったGPL、MPL、BSD型ライセンスについても再度説明を加えつつ、特許への対応がされている事実と、その内容について把握させる。
en: At last, explaines comparison from 3rd to 5th class such as GPL, MPL, BSD licenses, and these licenses treats patent issues in its rules.

source: 本講義の内容は、ソフトウェアとビジネス・社会の接点を他の講義には無い角度から解説している点に特徴がある。
en: There is specialty of this lecture that explains from a view point of a contact point between software, and business and society

source: 本講義の教材は、OSSモデルカリキュラムを基にして新規に作成されたものである。
en: This material is created based on OSS model curriculum.

source: 特に、GPL、MPL、BSDライセンスについては、具体例を含めて解説をしている。
en: We explains with detailed description includes concrete example for GPL, MPL and BSD license.

source: 特許に関しては企業やコミュニティなどの立場毎に見方が異なること
en: There are several different positions on a software patent among companies and communities.

source: 特許に関するリスク
en: Risk on Patent

source: 特許権とOSS
en: Patent and OSS

source: 特許権と、ソフトウェアにおける特許権、さらにはオープンソース・ソフトウェアにおける特許権について話を進める。
en: Proceed a patent and software patent and patent with OSS.

source: 現代ではGPLをベースとするソフトウェアなしでは済まない部分もできていることから、GPLを正しく理解して対応することの重要さを認識させる。
en: In recent days, it is nothing to do without GPL-ed software, such as Linux, in our life, we should emphasize an importance of correct understandings of GPL.

source: 知的財産に纏わるソフトウェアのトラブル事例
en: Trouble example related to Intellectual properties

source: 知的財産に関するリスク管理の事例
en: Case study for risk management around IP

source: 知的財産権とは・ソフトウェアとライセンス
en: What is Intellectual Property - software and license

source: 知的財産権について、全容を把握させることと、オープンソース・ソフトウェアの講義で関係する範囲も意識させる。
en: Make understand the birds-eyes view of Intellectual property and scope view from OSS learning course.

source: 第10回から第12回では、OSSコミュニティ、OSSによるビジネスをする企業、OSS関係団体などにおける法律問題への対処などについて解説している。
en: From 10th to 12th, explains initiatives by OSS community, business entities which use OSS, and associations related OSS.

source: 第10回教材は、OSSならではのコミュニティによる開発と、法務分野のリスクについて学習する教材である。
en: In 10th class, it touches community based development on OSS project and legal risks.

source: 第11回教材は、企業のビジネスとOSSの関係について学習する教材であり、商用ソフトウェアへのOSSのコード混入に関するリスクと対策、OSSの利用時のコンサルテーションと保険サービスに関する事項の習得を目指す。
en: In 11th class material, student learn relationship between company business and OSS. Primary item is a risk and response when merging OSS code into commercial software. Second item is consultation service and insurance service for the risk.

source: 第12回教材は、OSSに深く寄与する団体の活動について学習する教材であり、The Linux Foundation の活動、Open Invention Networkの活動、日本における知識獲得の取り組みに関する事項の習得を目指す。
en: It explains associations deeply related to OSS in 12th class material. Examine detailed in The Linux Foundation, Open Invention Network, and activities in Japan.

source: 第13回、第14回でも、OSSライセンスの侵害による具体的な訴訟事例などを解説している。
en: In13th, 14th lecture, explains specific legal cases in infringement of OSS license.

source: 第13回教材は、OSSによるライセンス侵害の事例について学習する教材である。
en: The materials for 13th class, to learn license infringement case example by OSS.

source: 第14回教材は、いくつかの企業が抱える訴訟問題、ソフトウェア特許とOSSの課題に関する事項の習得を目指す。
en: There is several lawsuits case and an issue against software patent and OSS in 14th class material.

source: 第15回で全体のまとめと今後のOSSと法的課題について解説している。
en: In 15th, wrap-ups and discuss future legal issues.

source: 第15回教材は、全体のまとめと今後のOSSと法的課題について整理するための教材である。
en: The 15th material is to roundup series of lectures and forecast future legal issues on OSS.

source: 第1回では、今日の社会でのソフトウェアの位置づけ、商用ソフトウェアの開発から利用まで、ソフトウェアと知的財産権、オープンソース・ソフトウェアの生い立ちなど、本講義全体を通して学ぶ事項の概要を説明している。
en: In 1st lecture, explains position of software placed in the current society, from development of commercial software to its application, software and intellectual property, and birth of Open Source Software. There is brief abstraction of this series of lectures.

source: 第1回教材は、今日の社会でのソフトウェアの位置づけ、商用ソフトウェアの開発から利用まで、ソフトウェアと知的財産権、オープンソース・ソフトウェアの生い立ちに関する事項の習得を目指す。
en: A purpose of 1st lecture is acquisition of position of software in current society, software life cycle from development of commercial software to utilize of software, software and intellectual property, and birth of Open Source Software.

source: 第2回から第5回までは、ビジネスを意識したライセンスの話題をOSSと商用ライセンスの違い、主要ライセンス概説、目的に応じたライセンスの選択について説明している。
en: From 2nd to 5th lecture, explains a difference between OSS and production software licenses especially for applications and issues toward business, and general information of major licenses, selection criteria in response to its purpose.

source: 第2回教材は、OSSの定義の説明をした後、OSSと商用ライセンスの違い、主要ライセンス概説、目的に応じたライセンスの選択に関する事項の習得を目指す。
en: In 2nd class, we will explain the definition of OSS, then showing contrast among OSS and business licenses. Explaining abstraction of major licenses and share criteria how to select OSS licenses.

source: 第3回OSSモデルカリキュラム導入実証
en: Third initiative for OSS Model Curriculum

source: 第3回教材は、GPLの歴史・定義・特徴、GPLで配布されているソフトウェア、ライセンスの伝搬性、GPL違反に関する事例など、GPLを取り巻く様々な話題に関する事項の習得を目指す。
en: Express history of GPL, definitions and characteristics of GPL in 3rd class. Also lecture list major GPL-ed software up, propagation of license, legal case against GPL. Understanding many aspect of GPL.

source: 第4回教材は、MPLの概要・歴史・特徴、MPL関連ライセンス、MPL関連ライセンスで公開されているソフトウェアに関する事項の習得を目指す。
en: Lecture about topics of MPL in 4th lecture, such as abstract, history and characteristics of MPL, relevant licenses of MPL, software which are distributed in MPL and similar licenses.

source: 第5回教材は、BSDライセンスの概要・歴史・特徴、BSDスタイルのライセンス、BSDスタイルのライセンスで配付されているソフトウェアに関する事項の習得を目指す。
en: Abstract of BSD license, history, characteristics and BSD style related licenses, and software which are distributed on BSD style license in 5th class.

source: 第6回から第9回では、知的財産権、著作権、特許権、商標権など、OSSに関連する法制度について説明し、具体的な訴訟事例などを挙げて、法務分野におけるOSSのリスクについて説明している。
en: From 6th to 9th lecture, we touch a law system such as Intellectual Property, copyright, patent, and trademark. There is a detailed explanation of specific litigation case, in order to discuss OSS risks in legal field.

source: 第6回教材は、知的財産権について学習する教材であり、著作権の一般的な説明、および各国の著作権の扱い、著作権とOSSに関する事項の習得を目指す。
en: In 6th class, learns Intellectual property. There is general explanation of copyright, copyright rule difference among countries, and relation between OSS and copyright.

source: 第7回教材は、特許権について学習する教材であり、特許権の一般的な説明、および各国のソフトウェア特許の扱い、特許権とOSSに関する事項の習得を目指す。
en: In 7th class, focused on patent. Explains generics of patent, difference among country in patent, and relationship between patent and OSS.

source: 第8回教材は、知財について学習する教材であり、商標権とOSSについて、身近な事例などを紹介した。
en: learned from case study of trademark and OSS, intellectual property in 8th class.

source: 第9回教材は、法務分野におけるOSSのリスクについて学習する教材であり、著作権、特許侵害、訴訟問題に関するリスクと対策に関する事項の習得を目指す。
en: Risks of OSS is a theme of 9th class. Learns risks and treatment against copyright and patent infringement, and court challenges.

source: 第４章 GPL違反に関する事例などは、新しい事例があれば追加して説明する。
en: It is better to explain supplement of the case about GPL infringement, when it exists.

source: 総まとめ
en: roundup

source: 著作権とOSS
en: Copyright and OSS

source: 著作権については、概念は有名だが具体的な線引きについてはあやふやな理解をしていることも多いため、正しく理解をさせる。
en: Copyright is well known but understanding is often uncertain , teach correctly.

source: 著作権に関するリスク
en: Risk on Copyright

source: 著作権はソースコードそのものを保護、特許権はソフトウェアの動作原理に関するものであるということ
en: License will protect source code itself, but patent covers principle of process in software.

source: 著作権や特許の問題は、訴訟にまでなるということを事例に基づき伝える。
en: Explain with evidence that Issues form copyright and patent infringement become court challenge.

source: 訴訟リスク
en: Risk on judicial action

source: 講義の概要
en: Brief overview

source: 講義の概要を下記に示す。
en: The following is a brief overview of lecture.

source: 講義ノート
en: Lecture note

source: 講義全体の設計に際しては、下記に示す全体の流れに留意して講義を組み立てるように注意されたい。
en: Note that teachers should design their lecture course according to following caution.

source: 講義全体を通して、実社会での今後の動向を追うための基礎を身につけさせるという目的を持っている。
en: Throughout a series of lecture, we have a purpose that student learns basics of knowlegde to track movement and trend in actual society.

source: （株）三菱総合研究所
en: Mitsubishi Research Institute
